#include <glad/glad.h>
#include <GLFW/glfw3.h>
#define STB_IMAGE_IMPLEMENTATION
#include <stb_image.h>
#include <glm/glm.hpp>
#include <glm/gtc/matrix_transform.hpp>
#include <glm/gtc/type_ptr.hpp>
#include <iostream>
#include "Headers/MyShader.h"
#include "Headers/MyCamera.h"



void notused(){

    //---------------------------------------------<投光物概論>---------------------------------------------
    // 我們目前使用的光照都來自於空間中的一個點。它能給我們不錯的效果，但現實世界中，我們有許多種類的光照，每種的表現都不同。
    // 將光投射(Cast)到物體的光源叫做投光物(Light Caster)。在這一節中，我們將會討論幾種不同類型的投光物。
    // 學會模擬不同種類的光源是另一個能夠進一步豐富場景的工具。

    // 我們首先將會討論定向光(Directional Light)，接下來是點光源(Point Light)，它是我們之前學習的光源的拓展，最後我們將會討論聚光(Spotlight)。
    // 在下一節中我們將討論如何將這些不同種類的光照類型整合到一個場景之中。


    //---------------------------------------------<平行光>---------------------------------------------
    // 當一個光源處於很遠的地方時，來自光源的每條光線就會近似於互相平行。不論物體和/或觀察者的位置，看起來好像所有的光都來自於同一個方向。
    // 當我們使用一個假設光源處於無限遠處的模型時，它就被稱為定向光，因為它的所有光線都有相同的方向，它與光源的位置是沒有關係的。

    // 定向光非常好的一個例子就是太陽。太陽離我們並不是無限遠，但它已經遠到在光照計算中可以把它視為無限遠了。
    // 所以來自太陽的所有光線將被模擬為平行光線，我們可以在下圖中看到：
    // https://learnopengl.com/img/lighting/light_casters_directional.png
    
    // 因為所有的光線都是平行的，所以物體與光源的相對位置是不重要的，因為對場景中每個物體光的方向都是一致的。
    // 由於光的位置向量保持一致，場景中每個物體的光照計算將會是類似的。

    // 我們可以定義一個光線方向向量而不是位置向量來模擬定向光。
    // 著色器的計算基本上保持不變，但這次我們將直接使用光的direction向量而不是透過position來計算lightDir向量。
        // struct Light {
        //     // vec3 position; // 使用定向光就不再需要了
        //     vec3 direction;

        //     vec3 ambient;
        //     vec3 diffuse;
        //     vec3 specular;
        // };
        // ...
        // void main()
        // {
        // vec3 lightDir = normalize(-light.direction);
        // ...
        // }
    // 注意我們先對light.direction向量取反。我們目前使用的光照運算需求一個從片段到光源的光線方向，但人們更習慣定義定向光為一個從光源出發的全局方向。
    // 所以我們需要對全域光照方向向量取反來改變它的方向，它現在是一個指向光源的方向向量了。而且，記得將向量標準化，假設輸入向量為單位向量是很不明智的。

    // 最終的lightDir向量將和以前一樣用在漫反射和鏡面光計算中。
    // 為了清楚地顯示定向光對多個物體具有相同的影響，我們將會再次使用坐標系統章節最後的那個箱子派對的場景。
    // 如果你錯過了派對，我們先定義了十個不同的箱子位置，並對每個箱子都產生了一個不同的模型矩陣，每個模型矩陣都包含了對應的局部-世界座標變換：
        // lightingShader.setVec3("light.direction", -0.2f, -1.0f, -0.3f);
    
        // 我們一直將光的位置和位置向量定義為vec3，但有些人會喜歡將所有的向量定義為vec4。當我們將位置向量定義為一個vec4時，很重要的一點是要將w分量設為1.0，
        // 這樣變換和投影才能正確應用。然而，當我們定義一個方向向量為vec4的時候，我們不想讓位移有任何的效果（因為它僅僅代表的是方向），
        // 所以我們將w分量設定為0.0。
        // 方向向量就會像這樣來表示：vec4(0.2f, 1.0f, 0.3f, 0.0f)。這也可以作為一個快速偵測光照類型的工具：
        // 你可以偵測w分量是否等於1.0，來偵測它是否是光的位置向量；w分量等於0.0，則它是光的方向向量，這樣就能根據這個來調整光照計算了：
        // if(lightVector.w == 0.0) // 注意浮点数据类型的误差
        // // 执行定向光照计算
        // else if(lightVector.w == 1.0)
        // // 根据光源的位置做光照计算（与上一节一样）
        // 你知道嗎：這正是舊版OpenGL（固定函數式）決定光源是定向光還是位置光源(Positional Light Source)的方法，並根據它來調整光照。

    // 如果你現在編譯程序，在場景中自由移動，你就可以看到好像有一個太陽一樣的光源對所有的物體投光。
    // 你能注意到漫反射和鏡面光分量的反應都好像在天空中有一個光源的感覺嗎？它會看起來像這樣：
    // https://learnopengl.com/img/lighting/light_casters_directional_light.png


    //---------------------------------------------<點光源>---------------------------------------------
    // 定向光對於照亮整個場景的全局光源是非常棒的，但除了定向光之外我們也需要一些分散在場景中的點光源(Point Light)。
    // 點光源是處於世界中某一個位置的光源，它會朝著所有方向發光，但光線會隨著距離逐漸衰減。想像作為投光物的燈泡和火把，它們都是點光源。
    
    // https://learnopengl.com/img/lighting/light_casters_point.png
    // 在先前的教學中，我們一直都在使用一個（簡化的）點光源。我們在給定位置有一個光源，它會從它的光源位置開始朝著所有方向散射光線。
    // 然而，我們定義的光源模擬的是永遠不會衰減的光線，這看起來像是光源亮度非常的強。在大部分的3D模擬中，我們都希望模擬的光源只照亮光源附近的區域而不是整個場景。

    // 如果你將10個箱子加入到上一節光照場景中，你會注意到在最後面的箱子和在燈面前的箱子都以相同的強度被照亮，並沒有定義一個公式來將光隨距離衰減。
    // 我們希望在後排的箱子與前排的箱子相比僅僅是被輕微地照亮。

    // 衰減
    // 隨著光線傳播距離的增長逐漸削減光的強度通常叫做衰減(Attenuation)。隨距離減少光強度的一種方式是使用線性方程式。
    // 這樣的方程式能夠隨著距離的增長線性地減少光的強度，從而讓遠處的物體更暗。然而，這樣的線性方程式通常會看起來比較假。
    // 在現實世界中，燈在近處通常會非常亮，但隨著距離的增加光源的亮度一開始會下降非常快，但在遠處時剩餘的光強度就會下降的非常緩慢了。
    // 所以，我們需要一個不同的公式來減少光的強度。

    // 幸運的是一些聰明的人已經幫我們解決了這個問題。下面這個公式根據片段與光源的距離計算了衰減值，之後我們會將它乘以光的強度向量：
    //                    1.0
    //  Fatt =   ------------------------
    //            Kc + Kl * d + Kq * d^2
    // 在這裡 d 代表了片段距光源的距離。接下來為了計算衰減值，我們定義3個（可設定的）項：常數項Kc、一次項Kl和二次項Kq。
    // 常數項通常保持為1.0，它的主要作用是保證分母永遠不會比1小，否則的話在某些距離上它反而會增加強度，這肯定不是我們想要的效果。
    // 一次項會與距離值相乘，以線性的方式減少強度。
    // 二次項會與距離的平方相乘，讓光源以二次遞減的方式減少強度。二次項在距離比較小的時候影響會比一次項小很多，但當距離值比較大的時候它就會比一次項更大了。
    // 由於二次項的存在，光線會在大部分時候以線性的方式衰退，直到距離變得足夠大，讓二次項超過一次項，光的強度會以更快的速度下降。
    // 這樣的結果就是，光線在近距離時亮度很高，但隨著距離變遠亮度迅速降低，最後會以較慢的速度減少亮度。下面這張圖顯示了在100的距離內衰減的效果：
    // https://learnopengl.com/img/lighting/attenuation.png
    // 你可以看到光在近距離的時候有著最高的強度，但隨著距離增長，它的強度明顯減弱，並緩慢地在距離大約100的時候強度接近0。這正是我們想要的。

    // 選擇正確的值
    // 但是，該對這三個項設定什麼值呢？正確地設定它們的值取決於許多因素：環境、希望光覆蓋的距離、光的類型等。在大多數情況下，這都是經驗的問題，以及適量的調整。
    // 下面這個表格顯示了模擬一個（大概）真實的，覆蓋特定半徑（距離）的光源時，這些項可能取的一些值。第一列指定的是在給定的三項時光所能覆蓋的距離。
    // 這些值是大多數光源很好的起始點，它們由Ogre3D的Wiki所提供：
    // https://wiki.ogre3d.org/tiki-index.php?page=-Point+Light+Attenuation
        // 距離	常數項	 一次項	    二次項
        // 7	1.0	    0.7	        1.8
        // 13	1.0	    0.35	    0.44
        // 20	1.0	    0.22	    0.20
        // 32	1.0	    0.14	    0.07
        // 50	1.0	    0.09	    0.032
        // 65	1.0	    0.07	    0.017
        // 100	1.0	    0.045	    0.0075
        // 160	1.0	    0.027	    0.0028
        // 200	1.0	    0.022	    0.0019
        // 325	1.0	    0.014	    0.0007
        // 600	1.0	    0.007	    0.0002
        // 3250	1.0	    0.0014	    0.000007
        // 你可以看到，常數項 Kc 在所有的情況下都是1.0。一次項Kl為了覆蓋更遠的距離通常都很小，二次項Kq
        // 甚至更小。試著對這些值進行實驗，看看它們在你的實現中有什麼效果。在我們的環境中，32到100的距離對大多數的光源都足夠了。

    // 實現衰減
    // 為了實現衰減，在片段著色器中我們還需要三個額外的值：也就是公式中的常數項、一次項、二次項。它們最好儲存在之前定義的Light結構體中。
    // 注意我們使用上一節中計算lightDir的方法，而不是上面定向光部分的方法。
        // struct Light {
        //     vec3 position;  

        //     vec3 ambient;
        //     vec3 diffuse;
        //     vec3 specular;

        //     float constant;
        //     float linear;
        //     float quadratic;
        // };
    // 然後我們將在OpenGL中設定這些項：我們希望光源能夠覆蓋50的距離，所以我們會使用表格中對應的常數項、一次項和二次項：
        // lightingShader.setFloat("light.constant",  1.0f);
        // lightingShader.setFloat("light.linear",    0.09f);
        // lightingShader.setFloat("light.quadratic", 0.032f);
    // 在片段著色器中實現衰減還是比較直接的：我們根據公式計算衰減值，之後再分別乘以環境光、漫反射和鏡面光分量。
    // 我們仍需要公式中距光源的距離，還記得我們是怎麼計算一個向量的長度的嗎？我們可以透過取得片段和光源之間的向量差，並取得結果向量的長度作為距離項。
    // 我們可以使用GLSL內建的length函數來完成這一點：
        // float distance    = length(light.position - FragPos);
        // float attenuation = 1.0 / (light.constant + light.linear * distance + 
        //                 light.quadratic * (distance * distance));
    // 接下來，我們將包含這個衰減值到光照計算中，將它分別乘以環境光、漫反射和鏡面光顏色。
        // 我們可以將環境光分量保持不變，讓環境光照不會隨著距離減少，但是如果我們使用多於一個的光源，所有的環境光分量將會開始疊加，
        // 所以在這種情況下我們也希望衰減環境光照。簡單實驗一下，看看什麼才能在你的環境中效果最好。
        // ambient  *= attenuation; 
        // diffuse  *= attenuation;
        // specular *= attenuation;

    // 你可以看到，只有前排的箱子被照亮的，距離最近的箱子是最亮的。後排的箱子一點都沒有照亮，因為它們離光源實在太遠了。你可以在這裡找到程式的程式碼。
    // 點光源就是一個能夠配置位置和衰減的光源。它是我們光照工具箱中的另一個光照類型。


    //---------------------------------------------<聚光>---------------------------------------------
    // 我們要討論的最後一種類型的光是聚光(Spotlight)。聚光是位於環境中某個位置的光源，它只朝一個特定方向而不是所有方向照射光線。
    // 這樣的結果就是只有在聚光方向的特定半徑內的物體才會被照亮，其它的物體都會保持黑暗。聚光燈很好的例子就是路燈或手電筒。

    // OpenGL中聚光是用一個世界空間位置、一個方向和一個切光角(Cutoff Angle)來表示的，切光角指定了聚光的半徑（譯註：是圓錐的半徑不是距光源距離那個半徑）。
    // 對於每個片段，我們會計算片段是否位於聚光的切光方向之間（也就是在錐形內），如果是的話，我們就會相應地照亮片段。下面這張圖會讓你明白聚光是如何運作的：
    // https://learnopengl.com/img/lighting/light_casters_spotlight_angles.png
        //LightDir：從片段指向光源的向量。
        // SpotDir：聚光所指向的方向。
        // Phiϕ   ：指定了聚光半徑的切光角。落在這個角度之外的物體都不會被這個聚光照亮。
        // Thetaθ ：LightDir向量和SpotDir向量之間的夾角。在聚光內部的話 θ 值應該比 ϕ 值小
    // 所以我們要做的就是計算LightDir向量和SpotDir向量之間的內積（還記得它會傳回兩個單位向量夾角的餘弦值嗎？），並將它與切光角ϕ值對比。
    // 你現在應該了解聚光究竟是什麼了，下面我們將以手電筒的形式創造一個聚光。

    // 手電筒
    // 手電筒(Flashlight)是位於觀察者位置的聚光，通常它都會瞄準玩家視角的正前方。基本上說，手電筒就是普通的聚光，
    // 但它的位置和方向會隨著玩家的位置和方向而不斷更新。
    // 所以，在片段著色器中我們需要的值有聚光的位置向量（來計算光的方向向量）、聚光的方向向量和一個切光角。我們可以將它們儲存在Light結構體中：
        // struct Light {
        //     vec3  position;
        //     vec3  direction;
        //     float cutOff;
        //     ...
        // };
    // 接下來我們將適當的值傳到著色器中：
        // lightingShader.setVec3("light.position",  camera.Position);
        // lightingShader.setVec3("light.direction", camera.Front);
        // lightingShader.setFloat("light.cutOff",   glm::cos(glm::radians(12.5f)));

    // 你可以看到，我們並沒有為切光角設定一個角度值，反而是用角度值計算了一個餘弦值，將餘弦結果傳遞到片段著色器中。
    // 這樣做的原因是在片段著色器中，我們會計算LightDir和SpotDir向量的內積，這個內積回傳的將是一個餘弦值而不是角度值，所以我們不能直接使用角度值和餘弦值來比較。
    // 為了獲得角度值我們需要計算內積結果的反餘弦，這是一個開銷很大的計算。所以為了節省一點效能開銷，我們將會計算切光角對應的餘弦值，
    // 並將它的結果傳入片段著色器中。由於這兩個角度現在都由餘弦角來表示了，我們可以直接對它們進行比較而不用進行任何開銷高昂的計算。

    // 接下來就是計算θ值，並將它和切光角ϕ對比，來決定是否在聚光的內部：
        // float theta = dot(lightDir, normalize(-light.direction));
        // if(theta > light.cutOff){
        //  // 執行光照計算
        // }else{ // 否則，使用環境光，讓場景在聚光之外時不至於完全黑暗
        //     color = vec4(light.ambient * vec3(texture(material.diffuse, TexCoords)), 1.0);
        // }













}