#include <glad/glad.h>
#include <GLFW/glfw3.h>
#define STB_IMAGE_IMPLEMENTATION
#include <stb_image.h>
#include <glm/glm.hpp>
#include <glm/gtc/matrix_transform.hpp>
#include <glm/gtc/type_ptr.hpp>
#include <iostream>
#include "MyShader.h"

Shader ourShader("Shaders/shader.vs","Shaders/shader.fs");
float width,height, screenWidth,screenHeight;
GLuint VAO;


void notused(){
    // --------------------<座標系統>--------------------
    // 在上一個教程中，我們學習如何有效地利用矩陣的變換來變換所有頂點。 
    // OpenGL希望在每次頂點著色器運行後，我們可見的所有頂點都為標準化設備座標(Normalized Device Coordinate, NDC)。
    // 也就是說，每個頂點的x，y，z座標都應該在-1.0到1.0之間，超出這個座標範圍的頂點將不可見。
    // 我們通常會自己設定一個座標的範圍，之後再在頂點著色器中將這些座標轉換為標準化設備座標。然後將這些標準化設備座標傳入光柵器(Rasterizer)，
    // 將它們變換為螢幕上的二維座標或像素。
    
    // 將座標變換為標準化設備座標，接著再轉換為螢幕座標的過程通常是逐步進行的，也就是類似管線那樣子。
    // 在管線中，物體的頂點在最終轉換為螢幕座標之前還會被轉換到多個座標系統(Coordinate System)。
    // 將物件的座標變換到幾個過渡座標系(Intermediate Coordinate System)的優點在於，在這些特定的座標系統中，一些操作或運算更加方便和容易，
    // 這一點很快就會變得很明顯。對我們來說比較重要的總共有5個不同的座標系統：
        // 局部空間(Local Space，或稱為物件空間(Object Space))
        // 世界空間(World Space)
        // 觀察空間(View Space，或稱為視覺空間(Eye Space))
        // 裁剪空間(Clip Space)
        // 螢幕空間(Screen Space)
    // 這就是一個頂點在最終被轉換為片段之前需要經歷的所有不同狀態。
    // 你現在可能會對什麼是座標空間，什麼是座標系統感到非常困惑，所以我們將用一種更通俗的方式來解釋它們。
    // 下面，我們將顯示一個整體的圖片，之後我們會解釋每個空間的具體功能。


    // --------------------<概述>--------------------
    // 為了將座標從一個座標系轉換到另一個座標系，我們需要用到幾個變換矩陣，最重要的幾個分別是模型(Model)、觀察(View)、投影(Projection)三個矩陣。
    // 我們的頂點座標起始於局部空間(Local Space)，這裡它稱為局部座標(Local Coordinate)，它在之後會變成世界座標(World Coordinate)，
    // 觀察座標(View Coordinate)，裁剪座標(Clip Coordinate)，並最後以螢幕座標(Screen Coordinate)的形式結束。
    // 下面的這張圖顯示了整個流程以及各個變換過程做了什麼：
    // https://learnopengl.com/img/getting-started/coordinate_systems.png

    // 1.局部座標是物件相對於局部原點的座標，也是物體起始的座標。
    // 2.下一步是將局部座標轉換為世界空間座標，世界空間座標是處於一個更大的空間範圍的。
    //   這些座標相對於世界的全局原點，它們會和其它物體一起相對於世界的原點進行擺放。
    // 3.接下來我們將世界座標轉換為觀察空間座標，使得每個座標都是從攝影機或觀察者的角度來觀察的。
    // 4.座標到達觀察空間之後，我們需要將其投影到裁剪座標。裁剪座標會被處理至-1.0到1.0的範圍內，並判斷哪些頂點將會出現在螢幕上。
    // 5.最後，我們將裁剪座標變換為螢幕座標，我們將使用一個叫做視窗變換(Viewport Transform)的過程。
    //   視口變換將位於-1.0到1.0範圍的座標變換到由glViewport函數所定義的座標範圍內。最後變換出來的座標將會送到光柵器，將其轉換為片段。

    // 你可能已經大致了解了每個座標空間的作用。我們之所以將頂點轉換到各個不同的空間的原因是有些操作在特定的座標系統中才有意義且更方便。
    // 例如，當需要對物體進行修改的時候，在局部空間中來操作會更說得通；如果要對一個物體做出一個相對於其它物體位置的操作時，在世界坐標系中來做這個才更說得通，等等。
    // 如果我們願意，我們也可以定義一個直接從局部空間變換到裁剪空間的變換矩陣，但那樣會失去很多彈性。
    // 接下來我們將要更仔細地討論各個座標系統。

    // --------------------<局部空間>--------------------
    // 局部空間是指物體所在的座標空間，也就是物件最開始所在的地方。想像你在一個建模軟體（比如說Blender）中創建了一個立方體。
    // 你所創造的立方體的原點有可能位於(0, 0, 0)，即便它有可能最後在程式中處於完全不同的位置。
    // 甚至有可能你所創造的所有模型都以(0, 0, 0)為初始位置（譯註：然而它們會最終出現在世界的不同位置）。
    // 所以，你的模型的所有頂點都是在局部空間：它們相對於你的物體來說都是局部的。
    // 我們一直使用的那個箱子的頂點是被設定在-0.5到0.5的座標範圍中，(0, 0)是它的原點。這些都是局部座標。


    // --------------------<世界空間>--------------------
    // 如果我們將我們所有的物件匯入到程式當中，它們有可能會全擠在世界的原點(0, 0, 0)上，這並不是我們想要的結果。
    // 我們想為每個物體定義一個位置，以便在更大的世界當中放置它們。世界空間中的座標正如其名：是指頂點相對於（遊戲）世界的座標。
    // 如果你希望將物體分散在世界上擺放（特別是非常真實的），這就是你希望物體變換到的空間。物體的座標將會從局部變換到世界空間；
    // 這個變換是由模型矩陣(Model Matrix)實現的。

    // 模型矩陣是一種變換矩陣，它能透過對物體進行位移、縮放、旋轉來將它放在它本來應該在的位置或朝向。
    // 你可以將它想像為變換一個房子，你需要先將它縮小（它在局部空間中太大了），並將其位移至郊區的一個小鎮，然後在y軸上向左旋轉一點以搭配附近的房子。
    // 你也可以把上一節將箱子到處擺放在場景中用的那個矩陣大致看作一個模型矩陣；我們將箱子的局部座標變換到場景/世界中的不同位置。


    // --------------------<觀察空間>--------------------
    // 觀察空間常被人們稱為OpenGL的攝影機(Camera)（所以有時也稱為攝影機空間(Camera Space)或視覺空間(Eye Space)）。
    // 觀察空間是將世界空間座標轉換為使用者視野前方的座標所產生的結果。因此觀察空間就是從攝影機的視角所觀察到的空間。
    // 而這通常是由一系列的位移和旋轉的組合來完成，平移/旋轉場景從而使得特定的物件被變換到攝影機的前方。
    // 這些組合在一起的變換通常儲存在一個觀察矩陣(View Matrix)裡，它被用來將世界座標變換到觀察空間。
    // 在下一節中我們將深入討論如何創建一個這樣的觀察矩陣來模擬一個攝影機。


    // --------------------<裁剪空間>--------------------
    // 在一個頂點著色器運作的最後，OpenGL期望所有的座標都能落在一個特定的範圍內，而任何在這個範圍之外的點都應該被裁切掉(Clipped)。
    // 被裁切掉的座標就會被忽略，所以剩下的座標就會變成螢幕上可見的片段。這也就是裁剪空間(Clip Space)名字的由來。

    // 因為將所有可見的座標都指定在-1.0到1.0的範圍內不是很直觀，
    // 所以我們會指定自己的座標集(Coordinate Set)並將它變換回標準化設備座標系，就像OpenGL所期望的那樣。

    // 為了將頂點座標從觀察值變換到裁剪空間，我們需要定義一個投影矩陣(Projection Matrix)，它指定了一個範圍的座標，例如在每個維度上的-1000到1000。
    // 投影矩陣接著會將在這個指定的範圍內的座標變換為標準化設備座標的範圍(-1.0, 1.0)。
    // 所有在範圍外的座標不會被映射到在-1.0到1.0的範圍之間，所以會被裁剪掉。在上面這個投影矩陣所指定的範圍內，座標(1250, 500, 750)將是不可見的，
    // 這是由於它的x座標超出了範圍，它被轉換為一個大於1.0的標準化設備座標，所以被裁剪掉了。
        // 如果只是圖元(Primitive)，例如三角形，的一部分超出了裁剪體積(Clipping Volume)，
        // 則OpenGL會重新建構這個三角形為一個或多個三角形讓其能夠適合這個裁切範圍。

    // 由投影矩陣所建立的觀察箱(Viewing Box)被稱為平截頭體(Frustum)，每個出現在平截頭體範圍內的座標都會最終出現在使用者的螢幕上。
    // 將特定範圍內的座標轉換到標準化設備座標系的過程（而且它很容易被映射到2D觀察空間座標）被稱之為投影(Projection)，
    // 因為使用投影矩陣能將3D座標投影(Project)到很容易映射到2D的標準化設備座標系。

    // 一旦所有頂點被變換到裁剪空間，最終的操作——透視除法(Perspective Division)將會執行，在這個過程中我們將位置向量的x，y，z分量分別除以向量的齊次w分量；
    // 透視除法是將4D裁剪空間座標變換為3D標準化設備座標的過程。這一步驟會在每個頂點著色器運行的最後被自動執行。

    // 在這一階段之後，最終的座標將會被映射到螢幕空間中（使用glViewport中的設定），並被變換成片段。
    // 將觀察座標轉換為裁切座標的投影矩陣可以為兩種不同的形式，每種形式定義了不同的平截頭體。
    // 我們可以選擇建立一個正射投影矩陣(Orthographic Projection Matrix)或一個透視投影矩陣(Perspective Projection Matrix)。


    // --------------------<正射投影 Orthographic Projection>--------------------
    // 正射投影矩陣定義了一個類似立方體的平截頭箱，它定義了一個裁剪空間，在這空間之外的頂點都會被裁剪掉。
    // 建立正射投影矩陣需要指定可見平截頭體的寬、高和長度。在使用正射投影矩陣變換至裁剪空間之後處於這個平截頭體內的所有座標將不會被裁切掉。
    // 它的平截頭體看起來像一個容器：
    // https://learnopengl.com/img/getting-started/orthographic_frustum.png
    // 上面的平截頭體定義了可見的座標，它由寬、高、近(Near)平面和遠(Far)平面所指定。任何出現在近平面之前或遠平面之後的座標都會被裁剪掉。
    // 正射平截頭體直接將平截頭體內部的所有座標映射為標準化設備座標，因為每個向量的w分量都沒有進行改變；如果w分量等於1.0，透視除法則不會改變這個座標。

    // 要建立一個正射投影矩陣，我們可以使用GLM的內建函數glm::ortho：
    glm::ortho(0.0f, 800.0f, 0.0f, 600.0f, 0.1f, 100.0f);
    // 前兩個參數指定了平截頭體的左右座標，第三和第四參數指定了平截頭體的底部和頂部。透過這四個參數我們定義了近平面和遠平面的大小，
    // 然後第五和第六個參數則定義了近平面和遠平面的距離。這個投影矩陣會將處於這些x，y，z值範圍內的座標變換為標準化設備座標。

    // 正射投影矩陣直接將座標映射到2D平面中，也就是你的螢幕，但實際上一個直接的投影矩陣會產生不真實的結果，因為這個投影沒有將透視(Perspective)考慮進去。
    // 所以我們需要透視投影矩陣來解決這個問題。


    // --------------------<透視投影 Perspective Projection>--------------------
    // 如果你曾經體驗過實際生活帶給你的景象，你會注意到離你越遠的東西看起來更小。這個奇怪的效果稱之為透視(Perspective)。
    // 透視的效果在我們看一條無限長的高速公路或鐵路時尤其明顯，正如下面圖片顯示的那樣：
    // https://learnopengl.com/img/getting-started/perspective.png

    // 正如你看到的那樣，由於透視，這兩條線在很遠的地方看起來會相交。這正是透視投影想要模仿的效果，它是使用透視投影矩陣來完成的。
    // 這個投影矩陣將給定的平截頭體範圍映射到裁剪空間，除此之外還修改了每個頂點座標的w值，從而使得離觀察者越遠的頂點座標w分量越大。
    // 被變換到裁剪空間的座標都會在-w到w的範圍之間（任何大於這個範圍的座標都會被裁剪掉）。 
    // OpenGL要求所有可見的座標都落在-1.0到1.0範圍內，作為頂點著色器最後的輸出，因此，一旦座標在裁剪空間內之後，透視除法就會被應用到裁剪空間座標上：

    // 頂點座標的每個分量都會除以它的w分量，距離觀察者越遠頂點座標就會越小。
    // 這也是w分量非常重要的另一個原因，它能夠幫助我們進行透視投影。最後的結果座標就是處於標準化設備空間中的。
    // 如果你對正射投影矩陣和透視投影矩陣是如何計算的很感興趣（且不會對數學感到恐懼的話）我推薦這篇由Songho寫的文章。
    // http://www.songho.ca/opengl/gl_projectionmatrix.html

    // 在GLM中可以這樣創建一個透視投影矩陣：
    glm::mat4 proj = glm::perspective(glm::radians(45.0f), (float)width/(float)height, 0.1f, 100.0f);
    // 同樣，glm::perspective所做的其實就是創建了一個定義了可視空間的大平截頭體，任何在這個平截頭體以外的東西最後都不會出現在裁剪空間體積內，並且將會受到裁剪。
    // 一個透視平截頭體可以被看作一個不均勻形狀的箱子，在這個箱子內部的每個座標都會被映射到裁剪空間上的一個點。下面是一張透視平截頭體的圖片：
    // https://learnopengl.com/img/getting-started/perspective_frustum.png
    // 它的第一個參數定義了fov的值，它表示的是視野(Field of View)，並且設定了觀察空間的大小。
    // 如果想要一個真實的觀察效果，它的值通常設定為45.0f，但想要一個毀滅戰士(DOOM,經典的系列第一人稱射擊遊戲)風格的結果你可以將其設定一個更大的值。
    // 第二個參數設定了寬高比，由視口的寬除以高所得。第三和第四個參數設定了平截頭體的近和遠平面。我們通常設定近距離為0.1f，而遠距離設定為100.0f。
    // 所有在近平面和遠平面內且處於平截頭體內的頂點都會被渲染。
        // 當你把透視矩陣的near值設定太大時（如10.0f），OpenGL會將靠近攝影機的座標（在0.0f和10.0f之間）都裁剪掉，
        // 這會導致一個你在遊戲中很熟悉的視覺效果：太靠近一個物體的時候你的視線會直接穿過。 
    
    // 當使用正射投影時，每個頂點座標都會直接映射到裁剪空間中而不經過任何精細的透視除法（它仍然會進行透視除法，只是w分量沒有被改變（它保持為1），因此沒有起作用）。
    // 因為正射投影沒有使用透視，遠處的物體不會顯得更小，所以產生奇怪的視覺效果。由於這個原因，正射投影主要用於二維渲染以及一些建築或工程的程序，
    // 在這些場景中我們更希望頂點不會被透視所干擾。某些如Blender等進行三維建模的軟體有時在建模時也會使用正射投影，因為它在各個維度下都更準確地描繪了每個物體。
    // 下面你能夠看到在Blender裡面使用兩種投影方式的對比：
    // https://learnopengl.com/img/getting-started/perspective_orthographic.png
    // 你可以看到，使用透視投影的話，遠處的頂點看起來比較小，而在正射投影中每個頂點距離觀察者的距離都是一樣的。



    // --------------------<把它們都組合在一起>--------------------
    // 我們為上述的每一個步驟都創建了一個變換矩陣：模型矩陣、觀察矩陣和投影矩陣。一個頂點座標將會根據以下過程被變換到裁剪座標：
    // Vclip=Mprojection ⋅ Mview ⋅ Mmodel ⋅ Vlocal
    // 注意矩陣運算的順序是相反的（記住我們需要從右往左閱讀矩陣的乘法）。最後的頂點應該被賦值到頂點著色器中的gl_Position，OpenGL將會自動進行透視除法和裁切。
        // 然後呢？
        // 頂點著色器的輸出要求所有的頂點都在裁剪空間內，而這正是我們剛才使用變換矩陣所做的。 OpenGL然後對裁剪座標執行透視除法從而將它們變換到標準化設備座標。 
        // OpenGL會使用glViewPort內部的參數來將標準化設備座標映射到螢幕座標，每個座標都關聯了一個螢幕上的點（在我們的例子中是一個800x600的螢幕）。
        // 這個過程稱為視窗變換。
    // 這一章的主題可能會比較難理解，如果你仍然不確定每個空間的作用的話，你也不必太擔心。接下來你會看到我們是怎麼運用這些座標空間的，而且之後也會有足夠的例子。









    // --------------------<進入3D>--------------------
    // 既然我們知道如何將3D座標變換為2D座標，我們可以開始使用真正的3D物體，而不是枯燥的2D平面了。
    // 在開始進行3D繪圖時，我們先建立一個模型矩陣。這個模型矩陣包含了位移、縮放與旋轉操作，它們會被應用到所有物體的頂點上，以變換它們到全局的世界空間。
    // 讓我們變換一下我們的平面，將其繞著x軸旋轉，使它看起來像放在地上一樣。這個模型矩陣看起來是這樣的：
    glm::mat4 model;
    model = glm::rotate(model, glm::radians(-55.0f), glm::vec3(1.0f, 0.0f, 0.0f));
    // 透過將頂點座標乘以這個模型矩陣，我們將該頂點座標變換到世界座標。我們的平面看起來就是在地板上，代表全局世界裡的平面
    // 接下來我們需要建立一個觀察矩陣。我們想要在場景裡面稍微往後移動，以使得物體變成可見的（當在世界空間時，我們位於原點(0,0,0)）。
    // 想要在場景裡面移動，先仔細想想下面這個句子：
        // 將攝影機向後移動，和將整個場景向前移動是一樣的。
    // 這正是觀察矩陣所做的，我們以相反於攝影機移動的方向移動整個場景。因為我們想要往後移動，而OpenGL是一個右手座標系(Right-handed System)，
    // 所以我們需要沿著z軸的正方向移動。我們會透過將場景沿著z軸負方向平移來實現。它會給我們一種我們在往後移動的感覺。

        // 右手座標系(Right-handed System)
        // 按照慣例，OpenGL是一個右手座標系。簡單來說，就是正x軸在你的右手邊，正y軸朝上，而正z軸是朝向後方的。
        // 想像你的螢幕處於三個軸的中心，則正z軸穿過你的螢幕朝向你。坐標系畫起來如下：
        // https://learnopengl.com/img/getting-started/coordinate_systems_right_handed.png

        // 為了理解為什麼被稱為右手座標系，如下的步驟做：
            // 沿著正y軸方向伸出你的右臂，手指著上方。
            // 大拇指指向右方。
            // 食指指向上方。
            // 中指向下彎曲90度。
        // 如果你的動作正確，那麼你的大拇指指向正x軸方向，食指指向正y軸方向，中指指向正z軸方向。如果你用左手臂來做這些動作，你會發現z軸的方向是相反的。
        // 這個叫做左手座標系，它被DirectX廣泛使用。注意在標準化設備座標系中OpenGL實際上使用的是左手座標系（投影矩陣交換了左右手）。

    // 在下一個教學中我們將會詳細討論如何在場景中移動。就目前來說，觀察矩陣是這樣的：
    glm::mat4 view;
    // 注意，我們將矩陣往我們要進行移動場景的反方向移動。
    view = glm::translate(view, glm::vec3(0.0f, 0.0f, -3.0f));
    
    // 最後我們要做的是定義一個投影矩陣。我們希望在場景中使用透視投影，所以像這樣聲明一個投影矩陣：
    glm::mat4 projection;
    projection = glm::perspective(glm::radians(45.0f), screenWidth / screenHeight, 0.1f, 100.0f);

    // 既然我們已經創建了變換矩陣，我們應該將它們傳入著色器。首先，讓我們在頂點著色器中聲明一個uniform變換矩陣然後將它乘以頂點座標：
        // #version 330 core
        // layout (location = 0) in vec3 aPos;
        // …
        // uniform mat4 model;
        // uniform mat4 view;
        // uniform mat4 projection;

        // void main()
        // {
        //  // 注意乘法要從右向左讀
        //  gl_Position = projection * view * model * vec4(aPos, 1.0);
        //  …
        // }
    // 我們還應該將矩陣傳入著色器（這通常在每次的渲染迭代中進行，因為變換矩陣會經常變動）：
    int modelLoc = glGetUniformLocation(ourShader.ID, "model");
    glUniformMatrix4fv(modelLoc, 1, GL_FALSE, glm::value_ptr(model));
    //... // 觀察矩陣與投影矩陣與之類似

    // 我們的頂點座標已經使用模型、觀察和投影矩陣進行變換了，最終的物體應該會：
        // 稍微向後傾斜至地板方向。
        // 離我們有一些距離。
        // 有透視效果（頂點越遠，變得越小）。
        // 讓我們檢查一下結果是否符合這些要求：


    // --------------------<更加3D>--------------------
    // 到目前為止，我們一直都在使用一個2D平面，而且甚至在3D空間裡！所以，讓我們大膽地拓展我們的2D平面為一個3D立方體。
    // 要渲染一個立方體，我們一共需要36個頂點（6個面x 每個面有2個三角形組成x 每個三角形有3個頂點），這36個頂點的位置你可以從這裡取得。
    // https://learnopengl.com/code_viewer.php?code=getting-started/cube_vertices

    // 為了有趣一點，我們將讓立方體隨著時間旋轉：
    model = glm::rotate(model, (float)glfwGetTime() * glm::radians(50.0f), glm::vec3(0.5f, 1.0f, 0.0f));
    // 然後我們使用glDrawArrays來繪製立方體，但這次總共有36個頂點。
    glDrawArrays(GL_TRIANGLES, 0, 36);
    // 接著執行它
    // 這的確有點像是個立方體，但又有種說不出的奇怪。立方體的某些本應被遮擋住的面被繪製在了這個立方體其他面之上。
    // 之所以這樣是因為OpenGL是一個三角形一個三角形地來繪製你的立方體的，所以即便之前那裡有東西它也會覆蓋之前的像素。
    // 因為這個原因，有些三角形會被繪製在其它三角形上面，雖然它們本來不應該是被覆蓋的。

    // 幸運的是，OpenGL儲存深度資訊在一個叫做Z緩衝(Z-buffer)的緩衝中，它允許OpenGL決定何時覆蓋一個像素而何時不覆蓋。
    // 透過使用Z緩衝，我們可以設定OpenGL來進行深度測試。

    // --------------------<Z緩衝>--------------------
    // OpenGL儲存它的所有深度資訊於一個Z緩衝(Z-buffer)中，也被稱為深度緩衝(Depth Buffer)。 
    // GLFW會自動為你產生這樣一個緩衝（就像它也有一個顏色緩衝來儲存輸出影像的顏色）。深度值儲存在每個片段裡面（作為片段的z值），當片段想要輸出它的顏色時，
    // OpenGL會將它的深度值和z緩衝進行比較，如果當前的片段在其它片段之後，它將會被丟棄，否則將會覆蓋。這個過程稱為深度測試(Depth Testing)，它是由OpenGL自動完成的。

    // 然而，如果我們想要確定OpenGL真的執行了深度測試，首先我們要告訴OpenGL我們想要啟用深度測試；它預設是關閉的。我們可以透過glEnable函數來開啟深度測試。
    // glEnable和glDisable函數允許我們啟用或停用某個OpenGL功能。這個功能會一直保持啟用/停用狀態，直到另一個呼叫來停用/啟用它。
    // 現在我們要啟用深度測試，需要開啟GL_DEPTH_TEST：
    glEnable(GL_DEPTH_TEST);
    // 因為我們使用了深度測試，我們也想要在每次渲染迭代之前清除深度緩衝（否則前一幀的深度資訊仍然保存在緩衝中）。
    // 就像清除顏色緩衝一樣，我們可以透過在glClear函數中指定DEPTH_BUFFER_BIT位元來清除深度緩衝：
    glClear(GL_COLOR_BUFFER_BIT | GL_DEPTH_BUFFER_BIT);

    // 讓我們來重新執行一下程式看看OpenGL是否執行了深度測試
    // ... 就是這樣！一個開啟了深度測試，各個面都是紋理，而且還在旋轉的立方體！


    // --------------------<更多的立方體！>--------------------
    // 現在我們想在螢幕上顯示10個立方體。每個立方體看起來都是一樣的，差別在於它們在世界的位置及旋轉角度不同。
    // 立方體的圖形佈局已經定義好了，所以當渲染更多物體的時候我們不需要改變我們的緩衝數組和屬性數組，
    // 我們唯一需要做的只是改變每個對象的模型矩陣來將立方體變換到世界坐標系中。
    // 首先，讓我們為每個立方體定義一個位移向量來指定它在世界空間的位置。我們將在一個glm::vec3陣列中定義10個立方體位置：
    glm::vec3 cubePositions[] = {
        glm::vec3( 0.0f,  0.0f,  0.0f), 
        glm::vec3( 2.0f,  5.0f, -15.0f), 
        glm::vec3(-1.5f, -2.2f, -2.5f),  
        glm::vec3(-3.8f, -2.0f, -12.3f),  
        glm::vec3( 2.4f, -0.4f, -3.5f),  
        glm::vec3(-1.7f,  3.0f, -7.5f),  
        glm::vec3( 1.3f, -2.0f, -2.5f),  
        glm::vec3( 1.5f,  2.0f, -2.5f), 
        glm::vec3( 1.5f,  0.2f, -1.5f), 
        glm::vec3(-1.3f,  1.0f, -1.5f)  
    };

    // 現在，在遊戲循環中，我們調用glDrawArrays10次​​，但這次在我們渲染之前每次傳入一個不同的模型矩陣到頂點著色器。
    // 我們將會在遊戲循環中創建一個小的循環用不同的模型矩陣渲染我們的物件10次。注意我們也對每個箱子加了一點旋轉：
    glBindVertexArray(VAO);
    for(unsigned int i = 0; i < 10; i++){
        glm::mat4 model;
        model = glm::translate(model, cubePositions[i]);
        float angle = 20.0f * i; 
        model = glm::rotate(model, glm::radians(angle), glm::vec3(1.0f, 0.3f, 0.5f));
        ourShader.setMat4("model", model);

        glDrawArrays(GL_TRIANGLES, 0, 36);
    }
    // 這段程式碼將會在每次新立方體繪製出來的時候更新模型矩陣，如此總共重複10次。然後我們應該就能看到一個擁有10個正在奇葩地旋轉著的立方體的世界。
    

}