#include <glad/glad.h>
#include <GLFW/glfw3.h>
#define STB_IMAGE_IMPLEMENTATION
#include <stb_image.h>
#include <glm/glm.hpp>
#include <glm/gtc/matrix_transform.hpp>
#include <glm/gtc/type_ptr.hpp>
#include <iostream>
#include "MyShader.h"

GLuint VBO;


void notused(){
    // 在前面的教學中我們已經簡單提到該如何在OpenGL中使用顏色(Color)，但是我們至今所接觸到的都是很淺層的知識。
    // 本節我們將會更深入地討論什麼是顏色，並且也會為接下來的光照(Lighting)教學建立一個場景。

    // 現實世界中有無數種顏色，每個物體都有它們自己的顏色。我們需要使用（有限的）數值來模擬真實世界中（無限）的顏色，
    // 所以並不是所有現實世界中的顏色都可以用數值來表示的。然而我們仍能透過數值來表現出非常多的顏色，甚至你可能都不會注意到與現實的顏色有任何的差異。
    // 顏色可以數位化的由紅色(Red)、綠色(Green)和藍色(Blue)三個分量組成，它們通常被縮寫為RGB。只用這三個值就可以組合出任何一種顏色。
    // 例如，要取得一個珊瑚紅(Coral)色的話，我們可以定義這樣的一個顏色向量：
    glm::vec3 coral(1.0f, 0.5f, 0.31f);

    // 我們在現實生活中看到某一物體的顏色並不是這個物體真正擁有的顏色，而是它所反射的(Reflected)顏色。
    // 換句話說，那些不能被物體所吸收(Absorb)的顏色（被拒絕的顏色）就是我們能夠感知到的物體的顏色。
    // 例如，太陽光能被看見的白光其實是由許多不同的顏色組合而成的（如下圖）。如果我們將白光照在一個藍色的玩具上，
    // 這個藍色的玩具會吸收白光中除了藍色以外的所有子顏色，不被吸收的藍光被反射到我們的眼中，讓這個玩具看起來是藍色的。
    // 下圖顯示的是一個珊瑚紅的玩具，它以不同強度反射了多種顏色。
    // https://learnopengl.com/img/lighting/light_reflection.png
    // 你可以看到，白色的陽光實際上是所有可見顏色的集合，物體吸收了其中的大部分顏色。它只反射了代表物體顏色的部分，
    // 被反射顏色的組合就是我們所感知到的顏色（此例中為珊瑚紅）。

    // 這些顏色反射的定律被直接運用在圖形領域。當我們在OpenGL中創建一個光源時，我們希望給光源一個顏色。在上一段中我們有一個白色的太陽，
    // 所以我們也將光源設定為白色。當我們把光源的顏色與物體的顏色值相乘，得到的就是這個物體所反射的顏色（也就是我們所感知到的顏色）。
    // 讓我們再次審視我們的玩具（這次它還是珊瑚紅），看看如何在圖形學中計算它的反射顏色。我們將這兩個顏色向量作分量相乘，結果就是最終的顏色向量了：
    glm::vec3 lightColor(1.0f, 1.0f, 1.0f);
    glm::vec3 toyColor(1.0f, 0.5f, 0.31f);
    glm::vec3 result = lightColor * toyColor; // = (1.0f, 0.5f, 0.31f);

    // 我們可以看到玩具的顏色吸收了白色光源中很大一部分的顏色，但它根據自身的顏色值對紅、綠、藍三個分量都做出了一定的反射。
    // 這也表現了現實中顏色的工作原理。由此，我們可以定義物體的顏色為物體從一個光源反射各個顏色分量的大小。
    // 現在，如果我們使用綠色的光源又會發生什麼事呢？
    glm::vec3 lightColor(0.0f, 1.0f, 0.0f);
    glm::vec3 toyColor(1.0f, 0.5f, 0.31f);
    glm::vec3 result = lightColor * toyColor; // = (0.0f, 0.5f, 0.0f);

    // 可以看到，並沒有紅色和藍色的光線讓我們的玩具吸收或反射。這個玩具吸收了光線中一半的綠色值，但仍然也反射了一半的綠色值。
    // 玩具現在看起來是深綠色(Dark-greenish)的。我們可以看到，如果我們用綠色光源來照射玩具，那麼只有綠色分量能被反射和感知到，紅色和藍色都不能被我們感知到。
    // 這樣做的結果是，一個珊瑚紅的玩具突然變成了深綠色物體。現在我們來看另一個例子，使用深橄欖綠色(Dark olive-green)的光源：
    glm::vec3 lightColor(0.33f, 0.42f, 0.18f);
    glm::vec3 toyColor(1.0f, 0.5f, 0.31f);
    glm::vec3 result = lightColor * toyColor; // = (0.33f, 0.21f, 0.06f);
    // 可以看到，我們可以使用不同的光源顏色來讓物體顯現出意想不到的顏色。要有創意地利用顏色其實並不難。

    // 這些顏色的理論就夠了，下面我們來構造一個實驗用的場景。

    
    //---------------------------------------------<創建一個光照場景>---------------------------------------------
    // 在接下來的教學中，我們將會廣泛地使用顏色來模擬現實世界中的光照效果，創造出一些有趣的視覺效果。
    // 由於我們現在將會使用光源了，我們希望將它們顯示為可見的物體，並在場景中至少加入一個物體來測試模擬光照的效果。

    // 首先我們需要一個物體來作為被投光(Cast the light)的對象，我們將使用前面教程中的那個著名的立方體箱子。
    // 我們還需要一個物體來代表光源在3D場景中的位置。簡單起見，我們依然使用一個立方體來代表光源（我們已經擁有立方體的頂點資料是吧？）。

    // 填一個頂點緩衝物件(VBO)，設定一下頂點屬性指針和其它一些亂七八糟的東西現在對你來說應該很容易了，所以我們就不再贅述那些步驟了。
    // 如果你仍然覺得這很困難，我建議你複習之前的教學，並且在繼續學習之前先把練習過一遍。
    // 我們首先需要一個頂點著色器來繪製箱子。與先前的頂點著色器相比，容器的頂點位置是保持不變的（雖然這次我們不需要紋理座標了），因此頂點著色器中沒有新的程式碼。
    // 我們將會使用先前教學頂點著色器的精簡版：
        // #version 330 core
        // layout (location = 0) in vec3 aPos;

        // uniform mat4 model;
        // uniform mat4 view;
        // uniform mat4 projection;

        // void main()
        // {
        //     gl_Position = projection * view * model * vec4(aPos, 1.0);
        // }
    // 記得更新你的頂點資料和屬性指標使其與新的頂點著色器保持一致
    // （當然你可以繼續留著紋理資料和屬性指標。在這一節中我們將不會用到它們，但有一個全新的開始也不是什麼壞主意）。


    // 因為我們還要創造一個表示燈（光源）的立方體，所以我們還要為這個燈創建一個專門的VAO。
    // 當然我們也可以讓這個燈和其它物體使用同一個VAO，簡單地對它的model（模型）矩陣做一些變換就好了，
    // 然而接下來的教學中我們會頻繁地對頂點數據和屬性指針做出修改，我們不想讓這些修改影響到燈（我們只關心燈的頂點位置），因此我們有必要為燈創建一個新的VAO。
    unsigned int lightVAO;
    glGenVertexArrays(1, &lightVAO);
    glBindVertexArray(lightVAO);
    // 只需要綁定VBO不用再次設定VBO的數據，因為箱子的VBO數據中已經包含了正確的立方體頂點數據
    glBindBuffer(GL_ARRAY_BUFFER, VBO);
    // 設定燈立方體的頂點屬性（對我們的燈來說僅僅只有位置資料）
    glVertexAttribPointer(0, 3, GL_FLOAT, GL_FALSE, 3 * sizeof(float), (void*)0);
    glEnableVertexAttribArray(0);

    // 這段程式碼對你來說應該非常直覺。現在我們已經創建了表示燈和被照物體箱子，我們只需要再定義一個片段著色器就行了：
        // #version 330 core
        // out vec4 FragColor;

        // uniform vec3 objectColor;
        // uniform vec3 lightColor;

        // void main()
        // {
        //     FragColor = vec4(lightColor * objectColor, 1.0);
        // }
    // 這個片段著色器從uniform變數中接受物體的顏色和光源的顏色。正如本節一開始所討論的那樣，我們將光源的顏色和物體（反射的）顏色相乘。
    // 這個著色器理解起來應該很容易。我們把物體的顏色設定為之前提到的珊瑚紅色，並把光源設定為白色。
    // 在此之前不要忘記首先 use 對應的著色器程式（來設定uniform）
    // lightingShader.use();
    // lightingShader.setVec3("objectColor", 1.0f, 0.5f, 0.31f);
    // lightingShader.setVec3("lightColor", 1.0f, 1.0f, 1.0f);

    // 要注意的是，當我們修改頂點或片段著色器後，燈的位置或顏色也會隨之改變，這並不是我們想要的效果。
    // 我們不希望燈的顏色在接下來的教學中因光照計算的結果而受到影響，而是希望它能夠與其它的計算分離。
    // 我們希望燈一直保持明亮，不受其它顏色變化的影響（這樣它才更像是一個真實的光源）。

    // 為了實現這個目標，我們需要為燈的繪製創建另外的一套著色器，從而保證它能夠在其它光照著色器發生改變的時候不受影響。頂點著色器與我們目前的頂點著色器是一樣的，
    // 所以你可以直接把現在的頂點著色器用在燈上。燈的片段著色器為燈定義了一個不變的常量白色，確保了燈的顏色一直是亮的：
        // #version 330 core
        // out vec4 FragColor;

        // void main()
        // {
        //     FragColor = vec4(1.0); // 將向量的四個分量全部設定為1.0
        // }
    
    // 當我們想要繪製我們的物體的時候，我們需要使用剛剛定義的光照著色器來繪製箱子（或可能是其它的物體）。當我們想要繪製燈的時候，我們會使用燈的著色器。
    // 在之後的教學我們會逐步更新這個光照著色器，以便慢慢地達到更真實的效果。

    // 使用這個燈立方體的主要目的是為了讓我們知道光源在場景中的具體位置。我們通常在場景中定義一個光源的位置，但這只是一個位置，它並沒有視覺意義。
    // 為了顯示真正的燈，我們將表示光源的立方體繪製在與光源相同的位置。我們將使用我們為它新建的片段著色器來繪製它，讓它一直處於白色的狀態，不受場景中的光線影響。
    
    // 我們聲明一個全域vec3變數來表示光源在場景的世界空間座標中的位置：
    glm::vec3 lightPos(1.2f, 1.0f, 2.0f);
    // 然後我們把燈位移到這裡，然後將它縮小一點，讓它不那麼明顯：
    glm::mat4 model = glm::mat4(1.0f);
    model = glm::translate(model, lightPos);
    model = glm::scale(model, glm::vec3(0.2f));
    // 繪製燈立方體的程式碼應該與下面的類似：
    // lampShader.use();
    // 設定模型、視圖和投影矩陣uniform
    //…
    // 繪製燈立方體對象
    glBindVertexArray(lightVAO);
    glDrawArrays(GL_TRIANGLES, 0, 36);
    // 請把上述的所有程式碼片段放在你程式中合適的位置，這樣我們就能有一個乾淨的光照實驗場地了。若一切順利，運行效果將會如下圖所示：

    // 沒什麼好看的是嗎？但我保證在接下來的教程中它會變得更加有趣。

    // 如果你覺得將上面的程式碼片段整合到一起非常困難，可以來這裡看一下原始程式碼，並仔細研究我的程式碼和註解。

    // 我們現在已經對顏色有一定的了解了，並且已經創建了一個簡單的場景供我們之後繪製動感的光照，我們可以進入下一節進行學習，真正的魔法即將開始！

}