#include <glad/glad.h>
#include <GLFW/glfw3.h>
#define STB_IMAGE_IMPLEMENTATION
#include <stb_image.h>
#include <glm/glm.hpp>
#include <glm/gtc/matrix_transform.hpp>
#include <glm/gtc/type_ptr.hpp>
#include <iostream>
#include "Headers/MyShader.h"
#include "Headers/MyCamera.h"



void notused(){

    //---------------------------------------------<光照貼圖概論>---------------------------------------------
    // 在上一節中，我們討論了讓每個物體都擁有自己獨特的材質從而對光照做出不同的反應的方法。這樣子能夠很容易在一個光照的場景中給每個物體一個獨特的外觀，
    // 但是這仍不能對一個物體的視覺輸出提供足夠多的靈活性。

    // 在上一節中，我們將整個物體的材質定義為一個整體，但現實世界中的物體通常不只包含一種材質，而是由多種材質組成。
    // 想想一輛車：它的外殼非常有光澤，車窗會部分反射周圍的環境，輪胎不會那麼有光澤，所以它沒有鏡面高光，輪轂非常閃亮（如果你洗車了的話）。
    // 汽車同樣會有漫反射和環境光顏色，它們在整個物體上也不會是一樣的，汽車有著許多種不同的環境光/漫反射顏色。總之，這樣的物體在不同的部件上都有不同的材質屬性。

    // 所以，上一節的那個材質系統是肯定不夠的，它只是一個最簡單的模型，所以我們需要拓展之前的系統，引入漫反射和鏡面光貼圖(Map)。
    // 這允許我們對物體的漫反射分量（以及間接地對環境光分量，它們幾乎總是一樣的）和鏡面光分量有著更精確的控制。


    //---------------------------------------------<漫反射貼圖>---------------------------------------------
    // 我們希望透過某種方式對物體的每個片段單獨設定漫反射顏色。有能夠讓我們根據片段在物體上的位置來取得顏色值的系統嗎？

    // 這可能聽起來很熟悉，而且事實上這個系統我們已經使用很久了。這聽起來很像在先前教程中詳細討論過的紋理，而這基本上就是這樣：
    // 一個紋理。我們只是對同樣的原理使用了不同的名字：其實都是使用一張覆蓋物體的圖像，讓我們能夠逐片段索引其獨立的顏色值。
    // 在光照場景中，它通常叫做一個漫反射貼圖(Diffuse Map)（3D藝術家通常都這麼叫它），它是一個表現了物體所有的漫反射顏色的紋理圖像。

    // 為了示範漫反射貼圖，我們將會使用下面的圖片，它是一個有鋼邊框的木箱：
    // https://learnopengl.com/img/textures/container2.png
    // 在著色器中使用漫反射貼圖的方法和紋理教學中是完全一樣的。但這次我們會將紋理儲存為Material結構體中的一個sampler2D。
    // 我們將先前定義的vec3漫反射顏色向量替換為漫反射貼圖。
        // 注意sampler2D是所謂的不透明類型(Opaque Type)，也就是說我們不能將它實例化，只能透過uniform來定義它。
        // 如果我們使用uniform以外的方法（例如函數的參數）實例化這個結構體，GLSL會拋出一些奇怪的錯誤。這也適用於任何封裝了不透明類型的結構體。
    
    // 我們也移除了環境光材質顏色向量，因為環境光顏色在幾乎所有情況下都等於漫反射顏色，所以我們不需要將它們分開儲存：
        // struct Material {
        //     sampler2D diffuse;
        //     vec3      specular;
        //     float     shininess;
        // }; 
        // ...
        // in vec2 TexCoords;
        // 如果你非常固執，仍想將環境光顏色設定為一個（漫反射值之外）不同的值，你也可以保留這個環境光的vec3，但整個物體仍只能擁有一個環境光顏色。
        // 如果想要對不同片段有不同的環境光值，你需要對環境光值單獨使用另一個紋理。
    // 注意我們將在片段著色器中再次需要紋理座標，所以我們聲明一個額外的輸入變數。接下來我們只需要從紋理中取樣片段的漫反射顏色值即可：
        // vec3 diffuse = light.diffuse * diff * vec3(texture(material.diffuse, TexCoords));
    // 不要忘記將環境光的材質顏色設定為漫反射材質顏色相同的值。
        // vec3 ambient = light.ambient * vec3(texture(material.diffuse, TexCoords));

    // 這就是使用漫反射貼圖的全部步驟了。你可以看到，這並不是什麼新的東西，但這能夠大大提高視覺品質。為了讓它正常工作，我們還需要使用紋理座標更新頂點數據，
    // 將它們作為頂點屬性傳遞到片段著色器，載入材質並綁定材質到合適的紋理單元。
    // 更新後的頂點數據可以在這裡找到。頂點資料現在包含了頂點位置、法向量和立方體頂點處的紋理座標。
    // 讓我們更新頂點著色器來以頂點屬性的形式接受紋理座標，並將它們傳遞到片段著色器中：
        // #version 330 core
        // layout (location = 0) in vec3 aPos;
        // layout (location = 1) in vec3 aNormal;
        // layout (location = 2) in vec2 aTexCoords;
        // ...
        // out vec2 TexCoords;

        // void main()
        // {
        //     ...
        //     TexCoords = aTexCoords;
        // }

    // 記得去更新兩個VAO的頂點屬性指針來匹配新的頂點數據，並加載箱子圖像為一個紋理。
    // 在畫箱子之前，我們希望將要用的紋理單元賦值到material.diffuse這個uniform取樣器，並綁定箱子的紋理到這個紋理單元：
        // lightingShader.setInt("material.diffuse", 0);
        // ...
        // glActiveTexture(GL_TEXTURE0);
        // glBindTexture(GL_TEXTURE_2D, diffuseMap);


    //---------------------------------------------<鏡面光貼圖>---------------------------------------------
    // 你可能會注意到，鏡面高光看起來有些奇怪，因為我們的物體大部分都是木頭，我們知道木頭不應該有這麼強的鏡面高光的。
    // 我們可以將物體的鏡面光材質設定為來vec3(0.0)解決這個問題，但這也意味著箱子鋼製的邊框將不再能夠顯示鏡面高光了，我們知道鋼鐵應該是有一些鏡面高光的。
    // 所以，我們想要讓物體的某些部位以不同的強度顯示鏡面高光。這個問題看起來和漫反射貼圖非常相似。是巧合嗎？我想不是。
    // 我們同樣可以使用一個專門用於鏡面高光的紋理貼圖。這也意味著我們需要產生一個黑白的（如果你想得話也可以是彩色的）紋理，來定義物體每部分的鏡面光強度。
    // 下面是一個鏡面光貼圖(Specular Map)的範例：
    // https://learnopengl.com/img/textures/container2_specular.png

    // 鏡面高光的強度可以透過影像每個像素的亮度來獲取。鏡面光貼圖上的每個像素都可以由一個顏色向量來表示，例如說黑色代表顏色向量vec3(0.0)，
    // 灰色代表顏色向量vec3(0.5)。在片段著色器中，我們接下來會取樣對應的顏色值並將它乘以光源的鏡面強度。一個像素越“白”，乘積就會越大，物體的鏡面光分量就會越亮。

    // 由於箱子大部分都是由木頭組成，而且木頭材質應該沒有鏡面高光，所以漫反射紋理的整個木頭部分全部都轉換成了黑色。
    // 箱子鋼製邊框的鏡面光強度是有細微變化的，鋼鐵本身會比較容易受到鏡面高光的影響，而裂縫則不會。
        // 從實際角度來說，木頭其實也有鏡面高光，儘管它的反光度(Shininess)很小（更多的光被散射），影響也比較小，
        // 但是為了教學目的，我們可以假設木頭不會對鏡面光有任何反應。
    // 使用Photoshop或Gimp之類的工具，將漫反射紋理轉換為鏡面光紋理還是比較容易的，只需要剪下一些部分，將影像轉換為黑白的，並增加亮度/對比度就好了。


    //---------------------------------------------<採樣鏡面光貼圖>---------------------------------------------
    // 鏡面光貼圖和其它的紋理非常類似，所以程式碼也和漫反射貼圖的程式碼很類似。記得要保證正確地載入圖像並產生一個紋理物件。
    // 由於我們正在同一個片段著色器中使用另一個紋理採樣器，我們必須要對鏡面光貼圖使用一個不同的紋理單元（見紋理），
    // 所以我們在渲染之前先把它綁定到合適的紋理單元上：
        // lightingShader.setInt("material.specular", 1);
        // ...
        // glActiveTexture(GL_TEXTURE1);
        // glBindTexture(GL_TEXTURE_2D, specularMap);
    // 接下來更新片段著色器的材質屬性，讓其接受一個sampler2D而不是vec3作為鏡面光分量：
        // struct Material {
        //     sampler2D diffuse;
        //     sampler2D specular;
        //     float     shininess;
        // };
    // 最後我們希望採樣鏡面光貼圖，來取得片段所對應的鏡面光強度：
        // vec3 ambient  = light.ambient  * vec3(texture(material.diffuse, TexCoords));
        // vec3 diffuse  = light.diffuse  * diff * vec3(texture(material.diffuse, TexCoords));  
        // vec3 specular = light.specular * spec * vec3(texture(material.specular, TexCoords));
        // FragColor = vec4(ambient + diffuse + specular, 1.0);
    // 透過使用鏡面光貼圖我們可以對物體設定大量的細節，例如物體的哪些部分需要有閃閃發光的屬性，我們甚至可以設定它們對應的強度。
    // 鏡面光貼圖能夠在漫反射貼圖之上給予我們更高一層的控制。
        // 如果你想另闢蹊徑，你也可以在鏡面光貼圖中使用真正的顏色，不僅設定每個片段的鏡面光強度，還設定了鏡面高光的顏色。從現實角度來說，鏡面高光的顏色大部分（甚至全部）都是由光源本身決定的，
        // 所以這樣並不能產生非常真實的視覺效果（這也是為什麼影像通常是黑白的，我們只關心強度） 。
    
    // 如果你現在執行程式的話，你可以清楚地看到箱子的材質現在和真實的鋼製邊框箱子非常類似了：

    // 透過使用漫反射和鏡面光貼圖，我們可以為相對簡單的物體添加大量的細節。
    // 我們甚至可以使用法線/凹凸貼圖(Normal/Bump Map)或者反射貼圖(Reflection Map)為物件添加更多的細節，但這些將會留到之後的教學。
    // 把你的箱子給你的朋友或家人看看，並且堅信我們的箱子有一天會比現在更漂亮！











}